Revit 2026 API

# SketchPlaneGetPlaneReference Method

---

Returns a reference to this element as a plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference GetPlaneReference()
```
```vb
Public Function GetPlaneReference As Reference
```
```cpp
public:
Reference^ GetPlaneReference()
```
```fsharp
member GetPlaneReference : unit -> Reference
```

#### Return Value

Reference The reference.

The object returned here can be used with the PointOnPlane class.

#### Reference

SketchPlane Class

Autodesk.Revit.DB Namespace